:PROPERTIES:
:ID:       62F36E0F-5E82-4288-B348-8D5C88793CF2
:END:
#+title: Customizing Emacs' Modus themes

The [[https://protesilaos.com/emacs/modus-themes][Modus themes]] are a set of beautiful and customizable themes, which are shipped with Emacs since version 28.

They consist of two types: Modus Operandi is a light theme, and Modus Vivendi is its dark counterpart.
The tinted variants shift the background colors from white and black to a more pleasant light ochre and dark blue.

Select =modus-operandi-tinted= as the default theme:

#+begin_src emacs-lisp :noweb-ref theme-init
  (load-theme 'modus-operandi-tinted)
#+end_src

#+RESULTS:
: t

An interactive function named =modus-themes-toggle= switches between the light and dark themes.
By default, the function switches between the non-tinted versions, but that can be overwritten to use the tinted versions through the =modus-themes-to-toggle= variable:

#+name: themes-to-toggle
#+begin_src emacs-lisp :noweb-ref theme-config :exports none
  modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi-tinted)
#+end_src

#+begin_src emacs-lisp :noweb yes
  (setq <<themes-to-toggle>>)
#+end_src

#+RESULTS:
| modus-operandi-tinted | modus-vivendi-tinted |

Loading the initial theme and configuring which to toggle between is done in a single use-package specification.
Since the themes are built into Emacs, we use the =emacs= package, which immediately evaluates:

#+begin_src emacs-lisp :noweb yes :tangle theme.el
  (use-package emacs
    :init
    <<theme-init>>
    :custom
    <<theme-config>>)
#+end_src

* Auto-dark

[[https://github.com/LionyxML/auto-dark-emacs][Auto-dark]] automatically switches between dark and light themes based on the operating system's appearance.
Configure it to use the modus themes:

#+begin_src emacs-lisp :tangle theme.el
  (use-package auto-dark
    :ensure t
    :config
    (auto-dark-mode t)
    :custom
    (auto-dark-light-theme 'modus-operandi-tinted)
    (auto-dark-dark-theme 'modus-vivendi-tinted))
#+end_src
